Revit 2024 API
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures.AimErrEmptyName Property
 MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AimErrEmptyName { get; }
Visual Basic
Public Shared ReadOnly Property AimErrEmptyName As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AimErrEmptyName {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Class
Autodesk.Revit.DB Namespace